app/views/pages/profile.html.erb

                    <p class="post-title">
                        <span class="post-owner"><%= User.find(@p.user_id).username %></span>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT "posts".* FROM "posts" WHERE (user_id = 4)  ORDER BY "posts"."created_at" DESC