app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # Assign the post to the user who created it.
        respond_to do |f|
            if (@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hi"], ["user_id", 5], ["created_at", "2016-01-30 06:10:47.312248"], ["updated_at", "2016-01-30 06:10:47.312248"]]